package ru.geekbrains.lesson1.task2;

/*todo
    Задача 2: Техническое задание на разработку информационной системы UMarket.
        Вам доверено спроектировать и реализовать классы предметной области,
    которые позволяют в дальнейшем вести разработку ИС со следующим функционалом:
    1. Осуществлять учёт продовольственных и непродовольственных товаров, которыми торгует UMarket.
    2. Предоставлять покупателям возможность фильтрации продовольственных товаров по следующим видам:
        - Снеки;
        - Полуфабрикаты;
        - продукты для приготовления;
        - Все продовольственные товары.
    3. Формировать онлайн корзину из продовольственных товаров.
    4. Осуществлять балансировку онлайн корзины с целью получения такого набора продуктов питания,
    который включает все основные питательные элементы.
        Особенности бизнес-логики UMarket.
        Модуль онлайн покупок должен осуществлять контроль за попадающими в покупательскую корзину продуктами, а именно:
        - в онлайн корзину можно добавить только продовольственные товары;
        - в зависимости от желания покупателя, в онлайн корзине могут находиться как все присутствующие в UMarket
          продовольственные товары, так и исключительно товары той категории,
          которую выбрал покупатель посредством настроек фильтрации (фильтрация по видам продовольственных товаров).
        Необходимо предусмотреть типобезовасность онлайн корзины, так как в момент "автоматической балансировки" она
     должна пополняться продовольственными товарами из списка U-Market.
     Необходимо учесть, что в случае формирования онлайн корзины конкретного вида продовольственных товаров,
     дополнять корзину необходимо товарами именно из выбранной покупателем категории продовольственных товаров.
        С целью упрощения алгоритма балансировки онлайн корзины, будем считать, что каждый продовольственный
     продукт содержит всего лишь один питательный элемент: белки / жиры / углеводы.
     Следовательно, есть вероятность, что все выбранные товары будут представителями
     одного и того же питательного элемента (например, углеводными).
     В свою очередь, балансировка делает так, чтобы в корзине были представлены все питательные элементы.
 */
public class Program {
}
